brew "wget"           # you know what wget is
brew "gron"           # grep json easily
brew "viddy"          # modern watch command
brew "magic-wormhole" # easy PAKE-based file transfer
brew "tig"            # git tui client
brew "bat"            # cat replacement
brew "exa"            # ls replacement
brew "fd"             # find replacement
brew "ripgrep"        # better grep
brew "dust"           # du replacement
brew "hexyl"          # hex viewer
brew "choose-rust"    # cut replacement
brew "watchexec"      # run cmd on fs change
brew "gh"             # github cli
brew "minisign"       # ec25519 signature verification
